InformationRegisters/КадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КадровыйРезерв</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВключенияВРезерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеИсключенияИзРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьКадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьКадровыйРезерв</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКадровогоРезерва</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВключениеВКадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВключениеВКадровыйРезерв</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаВключениеВКадровыйРезерв</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УдалитьСтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.СтатусыГотовностиРезервистов</xr:Item>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.ИсторияКадровогоРезерва</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсторияКадровогоРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВключенияВКадровыйРезерв</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
					<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчастникКадровогоРезерва</Name>
							<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСКадровымиРезервистами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусГотовности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куратор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КадровыйРезерв/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(УчастникКадровогоРезерва)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ВыполнитьПервоначальноеЗаполнение");
	Методы.Вставить("ИсправитьДатуОкончанияКадровогоРезерва");
КонецПроцедуры

#КонецОбласти

// Получает данные резервиста по указанной позиции резерва.
//
// Параметры:
//  ПозицияРезерва - СправочникСсылка.КадровыйРезерв - Позиция резерва, по которой необходимо получить данные резервиста.
//  Резервист - СправочникСсылка.ФизическиеЛица - Резервист, данные которого необходимо получить.
//
// Возвращаемое значение:
//  Неопределено, Структура - Данные резервиста, содержащие поля:
//             ПозицияРезерва, ФизическоеЛицо, ДатаВключения, ДатаИсключения, Статус, Рейтинг, Наставник, Куратор.
//             Если данные не найдены, возвращается Неопределено.
//
Функция ДанныеРезервистаПоПозиции(ПозицияРезерва, Резервист) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПозицияРезерва", ПозицияРезерва);
	Запрос.УстановитьПараметр("Резервист", Резервист);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
		|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	КадровыйРезерв.Статус КАК Статус,
		|	КадровыйРезерв.Рейтинг КАК Рейтинг,
		|	КадровыйРезерв.Наставник КАК Наставник,
		|	КадровыйРезерв.Куратор КАК Куратор
		|ИЗ
		|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.ПозицияРезерва = &ПозицияРезерва
		|	И КадровыйРезерв.УчастникКадровогоРезерва = &Резервист";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеРезервиста = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
	Возврат ДанныеРезервиста;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ПозицияРезерва",
		"УправленческиеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

// Выполняет первоначальное заполнение при обновлении.
// Данные переносятся из регистра УдалитьКадровыйРезерв.
// Измерение УчастникКадровогоРезерва заполняется данными из измерения ФизическоеЛицо.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ВыполнитьПервоначальноеЗаполнение(ПараметрыОбновления) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	УдалитьКадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	УдалитьКадровыйРезерв.ФизическоеЛицо КАК ФизическоеЛицо,
		|	УдалитьКадровыйРезерв.Статус КАК Статус,
		|	УдалитьКадровыйРезерв.ДатаВключения КАК ДатаВключения,
		|	УдалитьКадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	УдалитьКадровыйРезерв.Рейтинг КАК Рейтинг,
		|	УдалитьКадровыйРезерв.ВидРезерва КАК ВидРезерва,
		|	УдалитьКадровыйРезерв.Наставник КАК Наставник,
		|	УдалитьКадровыйРезерв.Куратор КАК Куратор
		|ИЗ
		|	РегистрСведений.УдалитьКадровыйРезерв КАК УдалитьКадровыйРезерв
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
		|		ПО УдалитьКадровыйРезерв.ПозицияРезерва = КадровыйРезерв.ПозицияРезерва
		|			И УдалитьКадровыйРезерв.ФизическоеЛицо = КадровыйРезерв.УчастникКадровогоРезерва
		|ГДЕ
		|	КадровыйРезерв.ПозицияРезерва ЕСТЬ NULL
		|	И КадровыйРезерв.УчастникКадровогоРезерва ЕСТЬ NULL";

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.УдалитьКадровыйРезерв.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.КадровыйРезерв.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПозицияРезерва.Установить(Выборка.ПозицияРезерва);
			НаборЗаписей.Отбор.УчастникКадровогоРезерва.Установить(Выборка.ФизическоеЛицо);
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.УчастникКадровогоРезерва = Выборка.ФизическоеЛицо;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НаборЗаписей);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Исправляет реквизит ДатаОкончания при исключении из кадрового резерва
Процедура ИсправитьДатуОкончанияКадровогоРезерва(ПараметрыОбновления) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
	|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	КадровыйРезерв.Статус КАК Статус,
	|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
	|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
	|	КадровыйРезерв.Рейтинг КАК Рейтинг,
	|	КадровыйРезерв.ВидРезерва КАК ВидРезерва,
	|	КадровыйРезерв.Наставник КАК Наставник,
	|	КадровыйРезерв.Куратор КАК Куратор,
	|	КадровыйРезерв.ОснованиеВключенияВРезерв КАК ОснованиеВключенияВРезерв,
	|	КадровыйРезерв.ОснованиеИсключенияИзРезерва КАК ОснованиеИсключенияИзРезерва
	|ПОМЕСТИТЬ ВТНекорректныеЗаписи
	|ИЗ
	|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
	|ГДЕ
	|	КадровыйРезерв.ДатаИсключения < КадровыйРезерв.ДатаВключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНекорректныеЗаписи.ПозицияРезерва КАК ПозицияРезерва,
	|	ВТНекорректныеЗаписи.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	ВТНекорректныеЗаписи.Статус КАК Статус,
	|	ВТНекорректныеЗаписи.ДатаВключения КАК ДатаВключения,
	|	ИсторияКадровогоРезерва.ДатаОкончания КАК ДатаИсключения,
	|	ВТНекорректныеЗаписи.Рейтинг КАК Рейтинг,
	|	ВТНекорректныеЗаписи.ВидРезерва КАК ВидРезерва,
	|	ВТНекорректныеЗаписи.Наставник КАК Наставник,
	|	ВТНекорректныеЗаписи.Куратор КАК Куратор,
	|	ВТНекорректныеЗаписи.ОснованиеВключенияВРезерв КАК ОснованиеВключенияВРезерв,
	|	ВТНекорректныеЗаписи.ОснованиеИсключенияИзРезерва КАК ОснованиеИсключенияИзРезерва
	|ИЗ
	|	ВТНекорректныеЗаписи КАК ВТНекорректныеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
	|		ПО ВТНекорректныеЗаписи.ПозицияРезерва = ИсторияКадровогоРезерва.ПозицияРезерва
	|			И ВТНекорректныеЗаписи.УчастникКадровогоРезерва = ИсторияКадровогоРезерва.УчастникКадровогоРезерва
	|			И (НАЧАЛОПЕРИОДА(ИсторияКадровогоРезерва.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТНекорректныеЗаписи.ДатаВключения, ДЕНЬ))
	|			И ВТНекорректныеЗаписи.ВидРезерва = ИсторияКадровогоРезерва.ВидРезерва
	|ГДЕ
	|	(ИсторияКадровогоРезерва.Регистратор ССЫЛКА Документ.ВключениеВКадровыйРезерв
	|			ИЛИ ИсторияКадровогоРезерва.Регистратор ССЫЛКА Документ.РезультатыАттестацииСотрудников)";
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.КадровыйРезерв.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл 
				НоваяЗапись = РегистрыСведений.КадровыйРезерв.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				НоваяЗапись.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
